export const flat = [
  { value: 'noHotWatter', label: 'Нет горячей воды', text:
      'Упала молния в ручей. \n' +
      'Вода не стала горячей. \n' +
      'А что ручей до дна пронзен, \n' +
      'Сквозь шелест струй не слышит он. \n' +
      'Зато и молнии струя, \n' +
      'Упав, лишилась бытия. \n' +
      'Другого не было пути... \n' +
      'И я прощу, и ты прости.',
  author: 'Константин Случевский - Упала молния в ручей...',
  keyWords: 'Вода не стала горячей.'},

  {value: 'noColdWatter', label: 'Нет холодной воды', text:
      'В летний зной и в холода,\n' +
      'Лучше нет простой, природной\n' +
      'Из колодца, из пруда,\n' +
      'Из трубы водопроводной,\n' +
      'Из копытного следа,\n' +
      'Из реки, какой угодной,\n' +
      'Из ручья, из-подо льда,-\n' +
      'Лучше нет воды холодной,\n' +
      'Лишь вода была б - вода.',
    author: 'Александр Твардовский - Василий Теркин',
    keyWords: 'нет воды холодной,'},

  { value: 'loudNeighbors', label: 'Шумят соседи', text: '' +
      'Ты заскучал по дому? Что с тобою?\n' +
      'Еще вчера, гуляка из гуляк,\n' +
      'Ты проклинал дырявые обои\n' +
      'И эти стены с музыкой в щелях!\n' +
      'Здесь слышно всё, что делают соседи:\n' +
      'Вот — грош упал, а вот скрипит диван.\n' +
      'Здесь даже в самой искренней беседе\n' +
      'Словца не скажешь — разве если пьян!',
    author: 'Дмитрий Кедрин - Жилье',
  keyWords: 'Здесь слышно всё, что делают соседи:'},

  {value: 'noElectricity', label: 'Нет электричества', text:
      'Вот и пришёл я сюда о чудесных игрушках послушать\n' +
      'И небесных ватрушек покушать.\n' +
      'И говорит Крокодил:\n' +
      '- Пожалуйте, ваше величество!\n' +
      'Кокоша, поставь самовар!\n' +
      'Тотоша, зажги электричество!',
  author: 'Корней Чуковский - Крокодил',
  keyWords: 'Тотоша, зажги электричество!'},

  {value: 'noWarming', label: 'Нет отопления', text:
      'Сам, такой же, тот прохожий.\n' +
      'Печника тотчас узнал.\n' +
      '- Хорошо ругаться можешь,-\n' +
      'Поздоровавшись, сказал.\n' +
      'И вдобавок ни словечка,\n' +
      'Словно все, что было,- прочь.\n' +
      '- Вот совсем не греет печка.\n' +
      'И дымит. Нельзя ль помочь?',
    author: 'Александр Твардовский - Ленин и печник',
    keyWords: 'Вот совсем не греет печка.'},

  {value: 'loudDog', label: 'Громко лает соседская собака', text:
      'Привезли меня солдаты\n' +
      'К немке в дом, под Кенигсберг.\n' +
      'Дождь идет. Собака брешет.\n' +
      'У крыльца шумит дубок.\n' +
      'Здесь ничто меня не тешит,—\n' +
      'Только спичек коробок.',
    author: 'Дмитрий Кедрин - Полонянка',
    keyWords: 'Дождь идет. Собака брешет.'},

  // {value: '', label: '', text: '',
  //   author: '',
  //   keyWords: ''},

  // {value: '', label: '', text: '',
  //   author: '',
  //   keyWords: ''},

  // {value: '', label: '', text: '',
  //   author: '',
  //   keyWords: ''},
];

export const courtyard = [
  { value: 'removeTree', label: 'Мешает старое дерево', text:
      'Знаю, что только счастливый\n' +
      'Любим. Его голос\n' +
      'Радует всех. Он красив.\n' +
      'Уродливое дерево посреди двора\n' +
      'Говорит о скудости почвы, и все же\n' +
      'Прохожие бранят его уродцем,\n' +
      'И они правы.',
    author: 'Бертольт Брехт - Скверное время для поэзии',
  keyWords: 'Уродливое дерево посреди двора'},

  {value: 'aLotSnow', label: 'Не убран снег', text:
      'Если любишь - гори!\n' +
      'Если знаешь - забудь!\n' +
      'Заметает снегами мой путь.\n' +
      'Буду день до зари\n' +
      'Меж волнистых полян\n' +
      'От сверканий сегодня я пьян.\n' +
      'Сколько есть их по льдам,\n' +
      'Там стеклинок - я дам,\n' +
      'Каждой дам я себя опьянить...',
    author: 'Иннокентий Анненский - Сверкание',
    keyWords: 'Заметает снегами мой путь.'},

  {value: 'ice', label: 'На дорогах гололед', text:
      'Гололед на земле, гололед,\n' +
      'Целый год напролет, целый год,\n' +
      'Будто нет ни весны, ни лета.\n' +
      'Чем-то скользким одета планета,\n' +
      'Люди, падая, бьются об лед,\n' +
      'Гололед на земле, гололед,\n' +
      'Целый год напролет, целый год...',
    author: 'Владимир Высоцкий - Гололед',
    keyWords: 'Гололед на земле, гололед'},

  {value: 'aLotTrash', label: 'Не убирают мусор', text:
      'Я тоже несчастен. Я тоже Париж.\n' +
      'Под музыку желоба вой мой затянут.\n' +
      'В осколках бутылок, в обрезках жестянок,\n' +
      'Дыханием мусорных свалок дыша,\n' +
      'Он тоже столетний. Он тоже душа.',
    author: 'Павел Антокольский - Песня дождя',
    keyWords: 'Дыханием мусорных свалок дыша,'},

  {value: 'noLight', label: 'Нет освещения', text:
      '«И где же вода?» —\n' +
      'Удивилась лягушка.\n' +
      '«А детская где же?» —\n' +
      'Спросила кукушка.\n' +
      '«А где освещение?—\n' +
      'Вспыхнул светляк.—\n' +
      'Я ночью гуляю,\n' +
      'Мне нужен маяк».',
    author: 'Вера Инбер - Сдается квартира',
    keyWords: 'А где освещение?—'},

  {value: 'iceSickles', label: 'На доме висят сосульки', text:
      'Здесь не бывает солнечно.\n' +
      'Здесь лампы свет чуть льют.\n' +
      'Свисают сонные сосульки люстр.\n' +
      'А я хочу быть в гомоне среди людей.\n' +
      'Мне страшно в комнате души твоей.',
    author: 'Евгений Евтушенко - Твоя душа',
    keyWords: 'Свисают сонные сосульки люстр.'},

  // {value: '', label: '', text: '',
  //   author: '',
  //   keyWords: ''},

  // {value: '', label: '', text: '',
  //   author: '',
  //   keyWords: ''},
];

const house = [
  {value: 'dirtyElev', label: 'Кабина лифта исписана', text:
      'В новом лифте ехал Саша\n' +
      'На тринадцатый этаж.\n' +
      'Вместе с ним на том же лифте\n' +
      'Ехал синий Карандаш.\n' +
      'Поднимается кабина\n' +
      'На тринадцатый этаж,\n' +
      'А на стенке той кабины\n' +
      'Что-то пишет Карандаш.',
    author: 'Сергей Михалков - Лифт и Карандаш',
    keyWords: 'Что-то пишет Карандаш.'},

  {value: 'noLetters', label: 'Не приходят письма', text:
      'Так сердце бьется, так ноет сладко,\n' +
      'Пока я за спиной почтальона жду,\n' +
      'И не знаю, найду письмо, или не найду,\n' +
      'И мучит меня эта дорогая загадка.',
    author: 'Михаил Кузмин - Каждый вечер я смотрю с обрывов...',
    keyWords: 'И не знаю, найду письмо, или не найду,'},

  {value: 'doorNotClosing', label: 'Не закрывается дверь в парадную', text:
      'Как зримо возведен из толщи полнолунья\n' +
      'чертог для Божества, а дверь не заперта.\n' +
      'Как бедный Гоголь худ там, во главе бульвара,\n' +
      'и одинок вблизи вселенской полыньи.\n' +
      'Столь длительной луны над миром не бывало,\n' +
      'сейчас она пройдет. Ни слова о любви!',
    author: 'Белла Ахмадулина - Ни слова о любви! Но я о ней ни слова...',
    keyWords: 'чертог для Божества, а дверь не заперта.'},

  {value: 'noSmoking', label: 'Накурено в подъезде', text:
      'Кури.\n' +
      '- Ну давай, закурю.\n' +
      '- Великое дело, брат, обувь.\n' +
      '- Молчи, я и то говорю.\n' +
      'Беседа идет, не беседа,\n' +
      'Стоят они, курят вдвоем.',
    author: 'Александр Твардовский - Армейский сапожник',
    keyWords: 'Стоят они, курят вдвоем.'},

  {value: 'paintedWalls', label: 'Разрисованы стены в подьезде', text:
      'У русского царя в чертогах есть палата:\n' +
      'Она не золотом, не бархатом богата;\n' +
      'Не в ней алмаз венца хранится за стеклом;\n' +
      'Но сверху донизу, во всю длину, кругом,\n' +
      'Своею кистию свободной и широкой\n' +
      'Ее разрисовал художник быстроокой.\n' +
      'Тут нет ни сельских нимф, ни девственных мадон...',
    author: 'Александр Пушкин - Полководец',
    keyWords: 'Ее разрисовал художник быстроокой.'},

  {value: 'badWalls', label: 'Отвалилась штукатурка', text:
      'Добрый конь в зеленом поле\n' +
      'Без узды, один, по воле\n' +
      'Скачет, весел и игрив,\n' +
      'Хвост по ветру распустив...\n' +
      'Одинок я - нет отрады:\n' +
      'Стены голые кругом...',
    author: 'Михаил Лермонтов - Узник',
    keyWords: 'Стены голые кругом...'},

  // {value: '', label: '', text: '',
  //   author: '',
  //   keyWords: ''},

  // {value: '', label: '', text: '',
  //   author: '',
  //   keyWords: ''},
]


export const groupedOptions = [
  {
    label: 'Проблемы в квартире',
    options: flat,
  },
  {
    label: 'Проблемы во дворе',
    options: courtyard,
  },
  {
    label: 'Проблемы в доме',
     options: house,
  }
];
